Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཞིང་རྒྱ་མཚོར་རྗེས་སུ་བགྲོད་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the proceeding to oceans of realms by bodhisattvas.

source: ཆོས་རྒྱ་མཚོའི་ཚུལ་ལ་འཇུག་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know their entry into an ocean of the ways of the Dharma.

source: སེམས་ཅན་རྒྱ་མཚོའི་མཚན་ཉིད་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different characteristics of an ocean of beings.

source: བྱང་ཆུབ་སེམས་དཔའི་དམ་པར་སྤྱོད་པའི་ཚུལ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the miraculous manifestations of all the ways of the conduct of bodhisattvas.

source: སྨོན་ལམ་གྱི་ཚུལ་སྣ་ཚོགས་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the oceans of the various ways of their prayers.

source: རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་རྒྱ་མཚོ་རྣམ་པ་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of the ocean of their various miraculous manifestations.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ཇི་ལྟར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་འདས་པ་དང་། ད་ལྟར་བྱུང་བའི་བསྐལ་པ་སྣ་ཚོགས་རྒྱ་མཚོ་ལ་ཞུགས་ཏེ། ཁོང་དུ་ཆུད་པ་དེ་བཞིན་དུ་ཕྱི་མའི་མཐའ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ། རྒྱུན་མི་འཆད་པའི་མ་འོངས་པའི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “Noble one, in the same way that I know and comprehend the ocean of various kalpas in this Sahā realm in the past and in the present, I also know the ocean of the continuous succession of future kalpas.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་བ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way that I know the ocean of kalpas of the entire succession of world realms that are contained within the Sahā world realm, I also know the ocean of kalpas of the entire succession of world realms contained within the atoms of the Sahā world realm.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way that I know the ocean of kalpas of the entire succession of world realms contained within the atoms of the Sahā world realm, I also know the ocean of kalpas of all the world realms that surround the Sahā world realm in the ten directions.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ན་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་བརྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way that I know the ocean of kalpas of all the world realms that surround the Sahā world realm in the ten directions, I also know the ocean of kalpas of all the successive world realms present in all the world realms that surround the Sahā world realm in the ten directions.

source: ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ལ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way that I know the ocean of kalpas of all the successive world realms present in the world realms that surround the Sahā world realm in the ten directions, I also know the ocean of kalpas of all the world realms contained within the family of the Prabhāsa­vairocana world realms in all the ten directions.

source: ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ལ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་བ་རྒྱ་མཚོ་རྣམས་རབ་ཏུ་ཤེས་པ་དེ་བཞིན་དུ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་འདིར་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཚུལ་དུ་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ལོ་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དཀྱིལ་འཁོར་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བྱེ་བྲག་རྣམས་དང་།
en: “In the same way that I know the ocean of kalpas of all the world realms contained within the family of the Prabhāsa­vairocana world realms in all the ten directions, I also know the ocean of kalpas of all the successive world realms present in all the world realms that surround in the ten directions the family of the Prabhāsa­vairocana world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཆུ་ཀླུང་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གློང་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འཁྱིལ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རི་རབ་དང་།
en: “In the same way that I know the ocean of kalpas of all the successive world realms present in all the world realms that surround in the ten directions the family of the Prabhāsa­vairocana world realms, I also know the ocean of kalpas in the vast extent of the world realms contained in this ocean of world realms, Kusuma­tala­garbha­vyūhālaṃkāra.

source: འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འབྱུང་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་པདྨོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྡོང་པོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྟ་བགབ་དང་། འཇིག་རྟེན་གྱི་མྱིང་དུ་བྱ་བ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way, I know the ocean of kalpas in the ways of the world realms, in the circles of the world realms, in the field of the world realms, in the categories of the world realms, in the rivers of the world realms, in the vortexes of the world realms, in the revolving of the world realms, in the Sumerus of the world realms, in the arising of the world realms, in the lotuses of the world realms, in the trees of the world realms, in the toraṇas of the world realms, and in the naming of the world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པ། འདི་ཇི་ལྟར་ཤེས་པར་གྱུར་པ་དེ་བཞིན་དུ། ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་དག་གི་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “In the same way that I know the Kusuma­tala­garbha­vyūhālaṃkāra ocean of world realms, I also know and remember the ocean of prayers made in the past by the Bhagavat Vairocana in the endless, limitless ocean of world realms in the ten directions throughout the extent of the realm of phenomena, up to the ends of space.

source: རྗེས་སུ་དྲན་ནོ། །སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་དག་ལའང་ཤེས་ཤིང་། ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the oceans of his past activities.

source: སྔོན་ཡོངས་སུ་བསྒྲུབས་པའི་ཚུལ་རྒྱ་མཚོ་དག་ལའང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I know and comprehend the oceans of his past accomplishments.

source: བསྐལ་པ་མཐའ་དང་དབུས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་ལ་ཡང་དག་པར་བཞུགས་པ་མཛད་པ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his continuing in bodhisattva conduct during kalpas without end or middle.

source: ཞིང་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his ways of purifying realms.

source: སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་མཛད་པའི་ཐབས་ཀྱི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of his methods for ripening beings.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྙེན་བཀུར་མཛད་ཅིང་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་བ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his miraculous manifestations of going to the past tathāgatas and serving them.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོར་མཛད་པའི་སྦྱོར་བའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his engagement in venerating and making offerings to the past tathāgatas.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དག་གིས་ཆོས་བསྟན་པ་ཡོངས་སུ་བཟུང་བའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his ways of obtaining the Dharma teachings of the past tathāgatas.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of his attainment of bodhisattva samādhis.

source: ཡོ་བྱད་ལ་དབང་བསྒྱུར་བ་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་ནན་ཏན་ཏུ་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of his practicing the ocean of the qualities of the past tathāgatas.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the oceans of his ways of the perfection of generosity.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་མངོན་པར་བསྒྲུབ་པ་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of his accomplishment of the pure field of disciplines and the correct conduct of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of his attainment of bodhisattva patience.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of his powerful bodhisattva diligence.

source: བསམ་གཏན་གྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of his perfecting the aspects of dhyāna.

source: ཤེས་རབ་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of his ways of purifying the field of wisdom.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་སྐུའི་གཟུགས་བརྙན་ཡོངས་སུ་བསྟན་པ་མཛད་པའི་ཐབས་ཀྱི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his ways of methods in manifesting the images of his body through births in all the world realms.

source: ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཡོངས་ས་དག་པར་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his ways of purifying the field of the completely good conduct and prayer.

source: ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པར་མཛད་པ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his spreading through the ocean of realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་། ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of his ways of purifying all buddha realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་ཡེ་ཤེས་སྣང་བར་གྱུར་པ། རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the illumination of wisdom from all the tathāgatas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་གནས་པ་མཛད་པའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the miraculous manifestations of reaching the enlightenment of all buddhas.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend his ways of attaining the illumination of the wisdom of all the tathāgatas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཞུགས་ཏེ་ཐུགས་སུ་ཆུད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of his ways of comprehending the realization of omniscience.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the miraculous manifestation of the attainment of complete buddhahood.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་དང་རྣམ་པར་རོལ་བའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ways of displaying and the power of supremacy in turning the wheel of the Dharma.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the field of saṃsāra.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the past roots of merit of all bodhisattvas in the field of saṃsāra.

source: ཐོག་མའི་སྨོན་ལམ་གྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of initial prayers.

source: སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱེད་པ་དང་། གདུལ་བའི་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of the methods for ripening and guiding beings.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། སེམས་ཅན་རྒྱ་མཚོ་ཡོངས་སུ་སྨྱིན་པར་མཛད་པ་དེ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the Bhagavat’s ripening of an ocean of beings when he was practicing bodhisattva conduct in the past.

source: སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེའི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བའི་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of methods that increase the roots of merit of those beings in each instant of their minds.

source: ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of the attainment of samādhi.

source: གཟུངས་ཀྱི་སྒོ་རབ་ཏུ་ཐོབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of the attainment of the power of mental retention.

source: སྤོབས་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of the pure field of the wisdom of eloquence.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་གནོན་པའི་རྣམ་པར་འཕྲུལ་བའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of the miraculous manifestations of ascending all the bodhisattva bhūmis.

source: སྤྱོད་པའི་དྲ་བ་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I also know and comprehend the ocean of the ways of accomplishing the net of conduct.

source: མཐར་གྱིས་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱོགས་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །དེ་དག་གི་དབང་པོ་དང་སྟོབས་དང་།
en: I also know and comprehend the ocean of the ways of the wisdom that enters the direction of final accomplishment.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །ཇི་ལྟར་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སངས་རྒྱས་དང་།
en: I also know and comprehend the ocean of his miraculous manifestations of the powers, strengths, aspects of enlightenment, dhyānas, liberations, samādhis, and samāpattis.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་བྱུང་བ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དེ། མངོན་པར་བསྒྲུབས་པ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་དང་། ཡེ་ཤེས་ཀྱི་སྒྱུ་མའི་དྲ་བ་མཐའ་ཡས་པ་ལ་འཇུག་པ། ཆོས་ཀྱི་དབྱིངས་མཐའ་ཡས་པ་རྒྱས་པར་འགེངས་པ། སྒོ་མཐའ་ཡས་པ་ནས་ཤིན་ཏུ་བསྟན་པར་བྱ་བ། ཕྱི་མའི་མཐའི་བསྐལ་པར་གནས་པ་ལ་འཇིག་པས་བསྟན་པར་བྱ་བ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པར་བྱུང་བ་ཐམས་ཅད་ཀྱང་མ་འདྲེས་པར་ཤེས་ཤིང་།
en: “In the same way that I realize, know, and comprehend the ocean of the Bhagavat Vairocana’s buddha and bodhisattva conduct throughout the entire realm of phenomena, I also realize, know, and comprehend the ocean of buddha and bodhisattva conduct of all the tathāgatas and their entry into the infinite illusory net of wisdom, their pervasion of the infinite realm of phenomena, their teaching of infinite entrances, and their teaching through entering into remaining until the last of future kalpas, which appear distinctly within the ocean of the world realms of the ten directions, throughout the realm of phenomena up to the ends of space.

source: ཁོང་དུ་ཆུད་དེ་མངོན་པར་སྒྲུབ་བོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་བལྟ་བའི་ཡུལ་གྱི་ཡུལ་ནི་དེ་ལྟ་བུ་སྟེ།
en: Noble one, it is because this purview is that of the bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas.

source: དེའི་ཕྱིར་དེ་ལ་སྙོམས་པར་ཞུགས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པའི་ཚུལ་རབ་ཏུ་ཤེས་སོ། །
en: When I am resting in that, I know the minds and conduct of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་ཚོགས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: “I know the accumulation of good actions of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the defilement and the purification of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the various kinds of karma of all beings.

source: ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the entrances to samādhi of all śrāvakas.

source: ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ས་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the levels of samādhi of all śrāvakas.

source: རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པ་ཞི་བས་རྣམ་པར་འཕྲུལ་པ་ཡང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I know and comprehend the miraculous manifestation through the peace of the liberations of all pratyeka­buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ways of the ocean of samādhis of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ways of the ocean of the liberations of all bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the entry into the ocean of the liberations of all the tathāgatas.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཤཱཀྱའི་བུ་མོ་གོ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: Then Sudhana, the head merchant’s son, asked the Śākya maiden Gopā, “Āryā, how long has it been since you attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ། སྔོན་འདས་པའི་དུས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་འདས་པའི་ཕ་རོལ་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་འཇིགས་པ་བྱེད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: She answered, “Noble one, in the past, in times gone by, beyond as many kalpas as there are atoms in a hundred buddha realms, there was a world realm called Abhayaṃkarā.

source: འཇིག་རྟེན་གྱི་ཁམས། དེའི་བསྐལ་པ་འགྲོ་བའི་མཆོག་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: In that world there was a kalpa called Gatipravara.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་དབུས་སུ། གླིང་བཞི་པ་བདེ་བ་ཡོད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: In the center of that world realm there was a four-continent world called Kṣemāvatī.

source: གླིང་བཞི་པ་དེའི་འཛམ་བུའི་གླིང་གི་དབུས་སུ། རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་ཞེས་བྱ་བ། གྲོང་རྡལ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་ཕུལ་དུ་བྱ་བ་བྱུང་བ་སྟེ།
en: In the center of the Jambudvīpa of that four-continent world there was the royal capital called Druma­meru­śrī, the principal city from among eighty-four thousand cities.

source: རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེ་དང་། གྲོང་རྡལ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་པོ་དེ་དག་ཀྱང་སོ་སོ་ནས་སའི་གཞི་བཻཌཱུརྱ་སྔོན་པོ་ལས་གྲུབ་པ་ལ་གནས་པ།
en: In the royal capital Druma­meru­śrī and each of the eighty-four thousand towns, the ground was made of blue beryl.

source: རིན་པོ་ཆེ་བདུན་ལས་བྱས་པའི་ར་བས་ཀུན་ནས་བསྐོར་བ།
en: Walls made of the seven precious materials encircled them.

source: འོབས་སྤོས་ཆུས་ཡོངས་སུ་གང་བ་གཞི་གསེར་གྱི་བྱེ་མ་བདལ་བ། ཨུཏྤལ་དང་། པདྨོ་དང་། ཀུ་མུ་ཏ་དང་། མེ་ཏོག་པུནྡ་རི་ཀ་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་ཁ་དོག་དང་འོད་ཀྱི་དྲ་བ་སྣ་ཚོགས་ཤིང་དྲི་ཤིན་ཏུ་ཞིམ་པས་ཀུན་ནས་ཁྱབ་པ་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ།
en: And they were each encircled by seven moats that were filled with scented water and had bottoms covered in gold dust and surfaces covered with blue lotuses, red lotuses, night lotuses, and white lotuses that were the size of wagon wheels, shone with light rays of various colors, and had all-pervading lovely aromas.

source: རིན་པོ་ཆེ་ལས་བྱས་པའི་སྟེགས་བུའི་ཁྲི་འཕང་བདུན་ལས་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་གྱིས་ཀུན་ནས་དགྲིགས་པ།
en: There were rows of seven promenades made of the seven precious materials and seven rows of palm trees.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་གི་ནགས་ཚལ་གྱི་ཕྲེང་བ་དགྲིགས་པས་ཀུན་ནས་བསྐོར་བ་སྟེ།
en: They were encircled by seven successive planted forests of trees made of the seven precious materials. Above there was a canopy of a net of gold.

source: སྟེང་ནས་གསེར་གྱི་དྲ་བ་བྲེས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་ཕྱེ་བའི་མིག་མངས་རིས་མཛེས་པར་རྣམ་པར་བྲེས་པས་སའི་གཞི་ཤིན་ཏུ་སྤ་བར་གྱུར་བ།
en: The ground was beautifully adorned by various jewels arranged in checkerboard patterns.

source: དངོས་གྲུབ་ཅན་གྱི་ཚོགས་རྣམ་པར་རྒྱུ་བ།
en: Groups of siddhas wandered around.

source: བྱ་བཙུན་པའི་ཁྱུས་སྒྲ་སྐད་ཡིད་དུ་འོང་བའི་དབྱངས་སྙན་པ་ཕྱུང་བ།
en: From flocks of noble birds came the beautiful sound of their melodious songs.

source: བཟའ་ཤིང་གི་ར་བ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གིས་མཛེས་པར་བྱས་པ་ཤིན་ཏུ་སྐྱིད་ཅིང་ཕུན་སུམ་ཚོགས་པར་གནས་པ་སྐྱེས་པ་དང་།
en: The towns were beautified by a trillion parks.

source: བུད་མྱེད་བརྒྱ་སྟོང་རབ་ཏུ་དགའ་བས་གང་བ།
en: They had abundant good fortune, and they were filled with crowds of hundreds of thousands of joyful men and women.

source: སེར་བུ་བདེ་ཞིང་ཡིད་དུ་འོང་བས་བསྐྱེད་དེ། མེ་ཏོག་གི་ཆར་མང་པོ་རྒྱུན་མི་འཆད་པར་རབ་ཏུ་འགྲུལ་བ།
en: Pleasant, delightful breezes blew, and rains of many flowers continuously fell.

source: སའི་བདག་པོ་དམ་པ་བརྒྱ་ཕྲག་སྟོང་གི་གནས་སུ་གྱུར་པ་དག་སྟེ།
en: A hundred thousand kings dwelled among them.

source: གྲོང་རྡལ་ཆེན་པོ་དེ་དག་གི་རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་དང་། གསེར་གྱི་དྲ་བའི་རྒྱན་ལ་སྩོགས་པ་རླུང་གིས་བསྐྱོད་དེ། རོལ་མོ་མང་པོའི་སྒྲ་དང་མཉམ་པའི་སྒྲ་སྐད་བྱུང་བ་དག་ལས་ཡིད་དུ་འོང་བའི་ཚིག་འདི་སྐད་དག་འབྱུང་ངོ་། །
en: When all the precious trees, adornments of gold, and so on in the great towns were moved by the wind, there came from them the many sounds of music, and harmonious voices arose saying these happy words: ‘Bathe!

source: གསོལ་ཅིག་མནོབས་ཤིག་ཆོས་ལ་སྤྱོད་ཅིག །
en: Drink! Eat! Practice the Dharma!

source: བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: Develop the aspiration for enlightenment!

source: ཕྱིར་མྱི་ལྡོག་པའི་ས་ལ་མངའ་ཐོབ་པར་མཛོད་ཅིག །
en: Attain the power of the level of irreversibility!

source: ཁྱེད་རྣམས་བདེ་བར་གྱུར་ཅིག་ཅེས་ཟེར་རོ། །
en: Be happy!’

source: རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེར་ཁམས་ཀྱི་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “In the royal city of Druma­meru­śrī there was the king of the realm whose name was Dhanapati.

source: དེ་ལ་བཙུན་མོའི་འཁོར་བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོད་དོ། །བློན་པོ་བརྒྱ་ཕྲག་ལྔ་ཡོད་པར་གྱུར་ཏེ།
en: He had a harem of eighty-four thousand queens and five hundred ministers.

source: རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་དེ་ལ་བུ་ལྔ་བརྒྱ་ཡོད་པ་དེ་ཐམས་ཅད་ཀྱང་། དཔའ་བོ་རྟུལ་ཕོད་པ་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ། གཞན་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་ཤིན་ཏུ་མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོའི་མཆོག་ཤིན་ཏུ་རྒྱས་པ་དང་ལྡན་པ་ཤ་སྟག་གོ །
en: King Dhanapati had five hundred sons, and they were all courageous and heroic, with perfect bodies, victorious over opponents, handsome, attractive, and with a magnificent, supreme, beautiful color.
